:PROPERTIES:
:ID:       E679EB60-C52C-4489-8164-5892DE601136
:END:
#+TITLE: Linux
#+OPTIONS: num:t
#+startup: content
#+EXPORT_FILE_NAME: /home/si/Dropbox/Base/html/Linux.html
#+PROPERTY: header-args :eval no-export
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
** check port of application
#+begin_src sh :dir /sudo::  :results output
ps -aux |grep mongo
netstat -nap |grep 80
#+end_src

#+RESULTS:
: mongodb   308267  0.9  1.4 1544536 110820 ?      Ssl  21:30   0:25 /usr/bin/mongod --config /etc/mongod.conf
: root      314541  0.0  0.0  12324   652 pts/4    S+   22:12   0:00 grep mongo
: tcp        0      0 127.0.0.1:27017         0.0.0.0:*               LISTEN      308267/mongod       
: unix  2      [ ACC ]     STREAM     LISTENING     4021239  308267/mongod        /tmp/mongodb-27017.sock
: unix  3      [ ]         STREAM     CONNECTED     4027655  308267/mongod        

**** msgget
msgid= msgget(IPC_PRIVATE, 0777);

#+begin_src C :results output :exports both
#include <stdio.h>
#include "unistd.h"
#include "sys/types.h"
#include "stdlib.h"
#include "signal.h"
#include "sys/msg.h"

int main(int argc, char *argv[])
{
  int msgid;

  msgid= msgget(IPC_PRIVATE, 0777);
  if (msgid < 0) {
    printf("creat massage queue failed .\n");
    return -1;
  }

  printf("create massage queue success  with msgid %d.\n",  msgid);

  system("ipcs -q");
  return 0;
}

#+end_src

#+RESULTS:
#+begin_example

------ Nachrichtenwarteschlangen --------
Schlüssel msqid      Besitzer   Rechte     Benutzt-Bytes Nachrichten 
0x61091797 2          silin      777        0            0           
0x00000000 4          silin      777        0            0           
0x00000000 5          silin      777        0            0           
0x00000000 6          silin      777        0            0           
0x00000000 7          silin      777        0            0           
0x00000000 8          silin      777        0            0           
0x00000000 9          silin      777        0            0           
0x00000000 10         silin      777        0            0           
0x00000000 11         silin      777        0            0           
0x00000000 12         silin      777        0            0           

create massage queue success  with msgid 12.
#+end_example

**** msgsnd &  msgrcv

msgsnd(msgid, (void *)&sendbuffer, strlen(sendbuffer.message), 0);

receivelen = msgrcv(msgid, (void *)&receiverbuffer, messagelen, 100, 0);

#+begin_src C :results output :exports both
#include <stdio.h>
#include "unistd.h"
#include "sys/types.h"
#include "stdlib.h"
#include "signal.h"
#include "sys/msg.h"
#include "string.h"

#define messagelen 124


struct messqueue
{
  long type;
  char message[messagelen];
  char ID[4];
};


int main(int argc, char *argv[])
{
  int msgid;
  int receivelen;
  struct messqueue sendbuffer, receiverbuffer;
  sendbuffer.type = 100;
  receiverbuffer.type = 100;

  //create the massage queue
  msgid= msgget(IPC_PRIVATE, 0777);
  if (msgid < 0) {
    printf("creat massage queue failed .\n");
    return -1;
  }
  printf("create massage queue success  with msgid %d.\n",  msgid);

  //input your massage
  printf("please input your massage you want to send to massage queue \n");
  scanf("%s", sendbuffer.message);

  //wirte the massage(which is now in your struct messqueue) into massage queue msgid
  msgsnd(msgid, (void *)&sendbuffer, strlen(sendbuffer.message), 0);

  //clear receiverbuffer.massage
  memset(receiverbuffer.message, 0, messagelen);
  //read massage to receiverbuffer from massage queue msgid
  receivelen = msgrcv(msgid, (void *)&receiverbuffer, messagelen, 100, 0);

  printf("the receiverbuffer massage have %s .\n", receiverbuffer.message);
  printf("the long is %d .\n", receivelen);

  
  msgctl(msgid, IPC_RMID, NULL);

  system("ipcs -q");
  return 0;
}

#+end_src

#+RESULTS:
#+begin_example

------ Nachrichtenwarteschlangen --------
Schlüssel msqid      Besitzer   Rechte     Benutzt-Bytes Nachrichten 
0x61091797 2          silin      777        0            0           
0x00000000 4          silin      777        0            0           
0x00000000 5          silin      777        0            0           
0x00000000 6          silin      777        0            0           
0x00000000 7          silin      777        0            0           
0x00000000 8          silin      777        0            0           
0x00000000 9          silin      777        0            0           
0x00000000 10         silin      777        0            0           
0x00000000 11         silin      777        0            0           
0x00000000 12         silin      777        0            0           

create massage queue success  with msgid 14.
please input your massage you want to send to massage queue 
the receiverbuffer massage have
the long is 6 .
#+end_example

*** 2 pthread_id.c
using pid = getpid() to get pid of current pthread
#+begin_src C :results output :exports both
#include <stdio.h>
#include "unistd.h"
#include "sys/types.h"
#include "stdlib.h"
#include "signal.h"
#include "sys/msg.h"
#include "string.h"

int main( )
{
  pid_t pid;
  pthread_t tid;

  pid = getpid();
  tid = pthread_self();

  printf("pid is %d , and tid is %x\n", pid, (int)tid );
  return 0;
}


#+end_src

#+RESULTS:
: pid is 3406 , and tid is 960c4c0

